# 4.2 - Office finder mongo version

#### Encontramos tu oficina

In [1]:
# librerias

from pymongo import MongoClient

import pandas as pd

import folium

import re

In [2]:
# conexion a mongo

cliente=MongoClient()

db=cliente.companies

In [7]:
def get_data():   # realizar query y traer datos
    
    query=db.companies.find({'$and': [ {'$or': [{'category_code': 'games_video'},
                                                {'category_code': 'software'},
                                                {'category_code': 'web'},
                                                {'category_code': 'mobile'},
                                                {'category_code': 'photo_video'},
                                                {'category_code': 'ecomerce'},
                                                {'category_code': 'search'},
                                                {'category_code': 'network_hosting'}]},
                                      
                                      {'founded_year': {'$gte': 1999}},
                                      {'offices': {'$ne': []}},
                                      {'offices.longitude': {'$ne': []}},
                                      {'offices.latitude': {'$ne': []}},
                                      {'offices.longitude': {'$ne': None}},
                                      {'offices.latitude': {'$ne': None}},
                                      {'deadpooled_year': None},
                                      {'number_of_employees': {'$ne': None}},
                                      {'total_money_raised': {'$ne': None}}]},
                           
                            {'name': 1, '_id':0, 'offices.latitude': 1, 'offices.longitude': 1,
                             'founded_year': 1, 'category_code':1, 'number_of_employees':1,
                             'total_money_raised':1
                            })
    
    
    df=pd.json_normalize(data=query, record_path='offices',
                         meta=['category_code', 'name', 'number_of_employees',
                               'founded_year', 'total_money_raised'])
    
    
    df.insert(2, 'geo_loc', pd.Series(list(range(len(df)))))
    
    df['geo_loc']=df.apply(lambda x: [x['longitude'], x['latitude']], axis=1)
    
    return df

In [8]:
get_data().head(10)

,latitude,longitude,geo_loc,category_code,name,number_of_employees,founded_year,total_money_raised
0,34.090368,-118.393064,"[-118.393064, 34.090368]",web,Geni,18,2006,$16.5M
1,40.746497,-74.009447,"[-74.0094471, 40.7464969]",games_video,Joost,0,2006,$45M
2,37.387845,-122.055197,"[-122.055197, 37.387845]",web,Plaxo,50,2002,$28.3M
3,37.778613,-122.395289,"[-122.395289, 37.778613]",search,Powerset,60,2006,$22.5M
4,34.017606,-118.487267,"[-118.487267, 34.017606]",web,Mahalo,40,2007,$21M
5,37.788482,-122.409173,"[-122.409173, 37.788482]",games_video,Kyte,40,2006,$23.4M
6,37.480999,-122.173887,"[-122.173887, 37.480999]",mobile,Jingle Networks,35,2005,$88.7M
7,40.726040,-73.995722,"[-73.995722, 40.72604]",web,Meetup,75,2002,$18.3M
8,37.390056,-122.067692,"[-122.067692, 37.390056]",photo_video,SmugMug,62,2002,$0
9,37.423390,-122.089951,"[-122.0899512, 37.4233896]",mobile,Jajah,110,2005,$33M

In [16]:
def exchange(col):
    
    res=[]
    
    number=1
    
    symbol=1
    
    for e in col:
        
        if e[-1]=='k': number=1e3
        elif e[-1]=='M': number=1e6
        elif e[-1]=='B': number=1e9
            
        if e[0]=='£': symbol=1.3
        elif e[0]=='€' : symbol=1.12
        
        n_col=re.findall('[0-9.]+', e)[0]

        
        res.append(int(float(n_col) * number * symbol))
        
    return res

In [17]:
exchange(['$28.3M'])

[28300000]

In [18]:
def classifying(date, employees):
    
    company_class=[]
    
    for i in range(len(date)):
        
        if date[i]>=2008 and employees[i]<100:
            company_class.append('StartUp')
        else:
            company_class.append('BigCorp')
            
    
    return company_class

In [19]:
# llmada a los datos

df=get_data()

print('Numero total de compañias a considerar: ', len(df))

Numero total de compañias a considerar:  2670

In [20]:
df.head()

,latitude,longitude,geo_loc,category_code,name,number_of_employees,founded_year,total_money_raised
0,34.090368,-118.393064,"[-118.393064, 34.090368]",web,Geni,18,2006,$16.5M
1,40.746497,-74.009447,"[-74.0094471, 40.7464969]",games_video,Joost,0,2006,$45M
2,37.387845,-122.055197,"[-122.055197, 37.387845]",web,Plaxo,50,2002,$28.3M
3,37.778613,-122.395289,"[-122.395289, 37.778613]",search,Powerset,60,2006,$22.5M
4,34.017606,-118.487267,"[-118.487267, 34.017606]",web,Mahalo,40,2007,$21M

In [21]:
df['n_total_money']=exchange(df.total_money_raised)

df['company_class']=classifying(df.founded_year, df.number_of_employees)

df.head()

,latitude,longitude,geo_loc,category_code,name,number_of_employees,founded_year,total_money_raised,n_total_money,company_class
0,34.090368,-118.393064,"[-118.393064, 34.090368]",web,Geni,18,2006,$16.5M,16500000,BigCorp
1,40.746497,-74.009447,"[-74.0094471, 40.7464969]",games_video,Joost,0,2006,$45M,45000000,BigCorp
2,37.387845,-122.055197,"[-122.055197, 37.387845]",web,Plaxo,50,2002,$28.3M,28300000,BigCorp
3,37.778613,-122.395289,"[-122.395289, 37.778613]",search,Powerset,60,2006,$22.5M,22500000,BigCorp
4,34.017606,-118.487267,"[-118.487267, 34.017606]",web,Mahalo,40,2007,$21M,21000000,BigCorp